# SheetColumnWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..SheetColumnWidth Property
ScheduleField Class See Also
---
The width of the column on a sheet, measured in feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double SheetColumnWidth { get; set; }
```

Visual Basic
---
```text
Public Property SheetColumnWidth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SheetColumnWidth {
	double get ();
	void set (double value);
}
```

# ### Field Value
The width of the column.
# Remarks
In a schedule with an embedded ScheduleDefinition, a column may display two fields, one from each ScheduleDefinition. In that case, the larger of the two widths is used.
It is always aligned with the GridColumnWidth.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: sheetColumnWidth is negative. |

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace